Repository: andrewsafronov/arab-air-1
Catalog: AviasalesSDKTemplate/Resources/*.lproj/AviasalesTemplateLocalizable.strings
Languages: th

# LANGUAGE
source: en
th: th

# SHORT_TIME_FORMAT
source: %@h %@m
th: %@ชม. %@น.

# LONG_TIME_FORMAT
source: %@ h %@ min
th: %@ ชั่วโมง %@ นาที

# JR_ERROR_TITLE
source: ERROR
th: ผิดพลาด

# JR_BACK_TITLE
source: Back
th: กลับ

# JR_TRY_AGAIN_TITLE
source: Try again
th: กรุณาลองใหม่

# JR_CANCEL_TITLE
source: Cancel
th: ยกเลิก

source: Currency
th: สกุลเงิน

# JR_ANY_AIRPORT
source: Any airport
th: สนามบินใดก็ได้

# JR_OK_BUTTON
source: OK
th: ตกลง

# JR_DATE_PICKER_DEPARTURE_DATE_TITLE
source: Departure date
th: วันที่เดินทาง

# JR_DATE_PICKER_RETURN_DATE_TITLE
source: Return date
th: วันที่กลับ

# JR_DATE_PICKER_TRAVEL_DATES_TITLE
source: Flight dates
th: วันที่เดินทาง

# JR_DATE_PICKER_TODAY_DATE_TITLE
source: Today
th: วันนี้

# JR_DATE_PICKER_SEARCH_TICKETS_BUTTON
source: Search tickets
th: ค้นหาตั๋ว

# JR_SEARCHINFO_BUSINESS
source: Business
th: ธุรกิจ

# JR_SEARCHINFO_ECONOMY
source: Economy
th: ประหยัด

# JR_SEARCHINFO_PREMIUM_ECONOMY
source: Premium Economy
th: ชั้นประหยัดพรีเมี่ยม

# JR_SEARCHINFO_FIRST
source: First Class
th: ชั้นหนึ่ง

# JR_SEARCHINFO_PASSENGERS##{one}
source: %d passenger
th: %d คน

# JR_SEARCHINFO_PASSENGERS##{few}
source: %d passengers
th: ผู้โดยสาร %d คน

# JR_SEARCHINFO_PASSENGERS##{many}
source: %d passengers
th: ผู้โดยสาร %d ราย

# JR_SEARCHINFO_PASSENGERS##{other}
source: %d passengers
th: ผู้โดยสาร %d ราย

# JR_SEARCH_FORM_AIRPORT_CELL_EMPTY_DESTINATION
source: Arrival city
th: เมืองปลายทาง

# JR_SEARCH_FORM_AIRPORT_CELL_EMPTY_ORIGIN
source: Departure city
th: เมืองต้นทาง

# JR_SEARCH_FORM_COMPLEX_DATE
source: date
th: วันที่

# JR_SEARCH_FORM_COMPLEX_DESTINATION
source: to
th: ถึง

# JR_SEARCH_FORM_COMPLEX_ORIGIN
source: from
th: จาก

# JR_SEARCH_FORM_COMPLEX_SEARCH_SEGMENT_TITLE
source: multi-city
th: หลายเมือง

# JR_SEARCH_FORM_DATE_CELL_EMPTY_DIRECT
source: Depart
th: ออกเดินทาง

# JR_SEARCH_FORM_DATE_CELL_EMPTY_RETURN
source: Return
th: กลับ

# JR_SEARCH_FORM_DATE_CELL_RETURN_BUTTON_TITLE
source: return
th: กลับ

# JR_SEARCH_FORM_SIMPLE_SEARCH_SEGMENT_TITLE
source: basic
th: พื้นฐาน

# JR_SEARCH_FORM_SIMPLE_SEARCH_ONE_WAY_SEGMENT_TITLE
source: One-way
th: ขาเดียว

# JR_SEARCH_FORM_SIMPLE_SEARCH_ROUND_TRIP_SEGMENT_TITLE
source: Round-Trip
th: ไป-กลับ

# JR_SEARCH_FORM_TITLE
source: Search tickets
th: ค้นหาตั๋ว

# JR_SEARCH_FORM_SEARCH_BUTTON
source: SEARCH TICKETS
th: ค้นหาตั๋ว

# JR_SEARCH_FORM_EXCEEDED_THE_ALLOWABLE_NUMBER_OF_INFANTS
source: The number of infants traveling without seat may not exceed the number of accompanying adults.
th: จำนวนเด็กทารกที่ไม่มีที่นั่งต้องไม่เกินจำนวนผู้ใหญ่ที่เดินทางด้วย

# JR_SEARCH_FORM_AIRPORT_EMPTY_ORIGIN_ERROR
source: Please enter departure airport
th: กรุณาใส่ชื่อสนามบินต้นทาง

# JR_SEARCH_FORM_AIRPORT_EMPTY_DESTINATION_ERROR
source: Please enter arrival airport
th: กรุณาใส่ชื่อสนามบินปลายทาง

# JR_SEARCH_FORM_AIRPORT_EMPTY_SAME_CITY_ERROR
source: Departure and arrival airports should be different.
th: สนามบินต้นทางและปลายทางต้องไม่เหมือนกัน

# JR_SEARCH_FORM_AIRPORT_EMPTY_DEPARTURE_DATE
source: Please enter departure date
th: กรุณาใส่วันที่ออกเดินทาง

# JR_SEARCH_FORM_COMPLEX_PLACEHOLDER_AIRPORT_CELL_ACC
source: Select
th: เลือก

# JR_SEARCH_FORM_ADD_TRAVEL_SEGMENT
source: ADD
th: เพิ่ม

# JR_SEARCH_FORM_DELETE_TRAVEL_SEGMENT
source: DELETE
th: ลบ

# JR_SEARCH_FORM_PASSENGERS_DECREASE_BTN_TITLE_ACC
source: Reduce the number of passengers %@
th: ลดจำนวนผู้โดยสาร %@

# JR_SEARCH_FORM_PASSENGERS_INCREASE_BTN_TITLE_ACC
source: Increase the number of passengers %@
th: เพิ่มจำนวนผู้โดยสาร %@

# JR_SEARCH_FORM_PASSENGERS_COUNT_ACC
source: %@ passengers %@
th: %@ ผู้โดยสาร %@

# JR_SEARCH_FORM_PASSENGERS_FROM_2_TO_12_YEARS
source: UNDER 12
th: ต่ำกว่า 12

# JR_SEARCH_FORM_PASSENGERS_UP_TO_2_YEARS
source: UNDER 2
th: ต่ำกว่า 2

# JR_SEARCH_FORM_PASSENGERS_ADULTS##{one}
source: adult
th: ผู้ใหญ่

# JR_SEARCH_FORM_PASSENGERS_ADULTS##{few}
source: adults
th: ผู้ใหญ่

# JR_SEARCH_FORM_PASSENGERS_ADULTS##{many}
source: adults
th: ผู้ใหญ่

# JR_SEARCH_FORM_PASSENGERS_ADULTS##{other}
source: adults
th: ผู้ใหญ่

# JR_SEARCH_FORM_PASSENGERS_CHILDREN##{one}
source: child
th: เด็ก

# JR_SEARCH_FORM_PASSENGERS_CHILDREN##{few}
source: children
th: เด็ก

# JR_SEARCH_FORM_PASSENGERS_CHILDREN##{many}
source: children
th: เด็ก

# JR_SEARCH_FORM_PASSENGERS_CHILDREN##{other}
source: children
th: เด็ก

# JR_SEARCH_FORM_PASSENGERS_INFANTS##{one}
source: infant
th: ทารก

# JR_SEARCH_FORM_PASSENGERS_INFANTS##{few}
source: infants
th: ทารก

# JR_SEARCH_FORM_PASSENGERS_INFANTS##{other}
source: infants
th: ทารก

# JR_SEARCH_FORM_PASSENGERS_INFANTS##{many}
source: infants
th: ทารก

# JR_AIRPORT_PICKER_DESTINATION_MODE_TITLE
source: Destination
th: ปลายทาง

# JR_AIRPORT_PICKER_NEAREST_AIRPORTS
source: Nearest airports
th: สนามบินที่ใกล้ที่สุด

# JR_AIRPORT_PICKER_NEAREST_AIRPORTS_READING_ERROR
source: Geolocation service is temporarily unavailable
th: บริการ Geolocation ไม่สามารถให้บริการได้ชั่วคราว

# JR_AIRPORT_PICKER_ORIGIN_MODE_TITLE
source: Origin
th: ต้นทาง

# JR_AIRPORT_PICKER_NO_NEAREST_AIRPORTS
source: No airports near you
th: ไม่มีสนามบินในบริเวณใกล้เคียง

# JR_AIRPORT_PICKER_PLACEHOLDER_TEXT
source: Enter city or airport
th: ค้นหา

# JR_AIRPORT_PICKER_PLACEHOLDER_TEXT_SHORT
source: Search
th: ค้นหา

# JR_AIRPORT_PICKER_POPULAR_CATEGORY_MODE_TITLE
source: Interests
th: ความสนใจ

# JR_AIRPORT_PICKER_POPULAR_DESTINATIONS
source: Routes by interests
th: เส้นทางตามความสนใจ

# JR_AIRPORT_PICKER_BACK_BUTTON
source: Back
th: ย้อนกลับ

# JR_AIRPORT_PICKER_SEARCHED_AIRPORTS
source: Previous searches:
th: คุณได้ค้นหา

# JR_AIRPORT_PICKER_NOTHING_IS_FOUND
source: No results found
th: ไม่พบผลลัพธ์

# JR_AIRPORT_PICKER_SEARCHING_ON_SERVER_TEXT
source: Searching...
th: กำลังค้นหา...

# JR_AIRPORT_PICKER_UPDATING_NEAREST_AIRPORTS
source: Searching for the nearest airports...
th: ค้นหาสนามบินในบริเวณใกล้เคียง...

# JR_FILTER_BUTTON
source: Filters
th: ตัวกรอง

# JR_FILTER_RESET_ALL
source: Clear all
th: ลบทั้งหมด

# JR_FILTER_RESET
source: Clear
th: ลบ

# JR_FILTER_TICKETS_NOT_FOUND
source: No results found
th: ไม่พบผลการค้นหา

# JR_FILTER_STOPOVER_OVERNIGHT
source: Possible night stopover
th: จุดแวะพักค้างคืน

# JR_FILTER_PRICE_FILTER
source: Price
th: ราคา

# JR_FILTER_TOTAL_DURATION
source: Journey time
th: ระยะเวลา

# JR_FILTER_DELAY_DURATION
source: Stopover duration
th: ระยะเวลาการรอเปลี่ยนเครื่อง

# JR_FILTER_TOTAL_TIME_FROM
source: from
th: ตั้งแต่

# JR_FILTER_TOTAL_DURATION_FROM
source: from
th: ตั้งแต่

# JR_FILTER_TOTAL_DURATION_PRIOR_TO
source: to
th: ถึง

# JR_FILTER_TOTAL_DURATION_PRIOR_UP_TO
source: up to
th: นานสุด

# JR_FILTER_FLIGHTS_FOUND_MIN_PRICE##{one}
source: %d flight starting from %@
th: %d เที่ยวบินราคาเริ่มต้น %@

# JR_FILTER_FLIGHTS_FOUND_MIN_PRICE##{few}
source: %d flights starting from %@
th: %d เที่ยวบินราคาเริ่มต้น %@

# JR_FILTER_FLIGHTS_FOUND_MIN_PRICE##{many}
source: %d flights starting from %@
th: %d เที่ยวบินราคาเริ่มต้น %@

# JR_FILTER_FLIGHTS_FOUND_MIN_PRICE##{other}
source: %d flights starting from %@
th: %d เที่ยวบินราคาเริ่มต้น %@

# JR_FILTER_RETURN_DEPARTURE_TIME
source: Return Take-off Time
th: เวลาเครื่องออกขากลับ

# JR_FILTER_DEPARTURE_TIME
source: Outbound Take-off Time
th: เวลาออกไฟลท์ต่างประเทศ

# JR_FILTER_ARRIVAL_TIME
source: Outbound Landing Time
th: เวลาลงไฟลท์ต่างประเทศ

# JR_FILTER_RETURN_ARRIVAL_TIME
source: Return Landing Time
th: เวลาเครื่องลงขากลับ

# JR_FILTER_AIRPORTS_ORIGIN
source: From
th: จาก

# JR_FILTER_AIRPORTS_STOPOVER
source: Transfers
th: รถรับ-ส่ง

# JR_FILTER_AIRPORTS_DESTINATION
source: To
th: ถึง

# JR_FILTER_DAY_TIME_MORNING
source: morning
th: ช่วงเช้า

# JR_FILTER_DAY_TIME_DAY
source: afternoon
th: ช่วงบ่าย

# JR_FILTER_DAY_TIME_EVENING
source: evening
th: ช่วงเย็น

# JR_FILTER_GATES
source: Agencies
th: บริษัทตัวแทน

# JR_FILTER_GATES_ALL
source: All agencies
th: บริษัทตัวแทนทั้งหมด

# JR_FILTER_PAYMENT_METHODS
source: Methods of payment
th: วิธีการชำระเงิน

# JR_FILTER_PAYMENT_METHODS_ALL
source: All methods of payment
th: วิธีการชำระเงินทั้งหมด

# JR_FILTER_AIRLINES
source: Airlines
th: สายการบิน

# JR_FILTER_AIRLINES_ALL
source: All airlines
th: สายการบินทั้งหมด

# JR_FILTER_ALLIANCES
source: Alliances
th: พันธมิตร

# JR_FILTER_OTHER_ALLIANCES
source: Airlines without any alliances
th: สายการบินที่ไม่ได้เป็นพันธมิตร

# JR_FILTER_ALLIANCES_ALL
source: All alliances
th: พันธมิตรทั้งหมด

# JR_FILTER_AIRPORTS
source: Airports
th: สนามบิน

# JR_FILTER_AIRPORTS_ALL
source: All airports
th: สนามบินทั้งหมด

# JR_SEARCH_RESULTS_TRANSFERS##{zero}
source: Direct
th: บินตรง

# JR_SEARCH_RESULTS_TRANSFERS##{one}
source: %d stop
th: หยุด %d แห่ง

# JR_SEARCH_RESULTS_TRANSFERS##{few}
source: %d stops
th: หยุด %d แห่ง

# JR_SEARCH_RESULTS_TRANSFERS##{many}
source: %d stops
th: หยุด %d แห่ง

# JR_SEARCH_RESULTS_TRANSFERS##{other}
source: %d stops
th: หยุด %d แห่ง

# JR_SEARCH_RESULTS_TICKET_PLACEHOLDER_TEXT
source: No options left after filtering
th: ไม่มีผลลัพธ์เหลือหลังทำการกรอง

# JR_BROWSER_BACK_BTN_TITLE
source: Back
th: กลับ

# JR_BROWSER_FORWARD_BTN_TITLE
source: Forward
th: ไปข้างหน้า

# JR_BROWSER_ERROR_ALERT_TITLE
source: Error
th: ผิดพลาด

# BROWSER_CHECK_CONNECTION
source: Please check your Internet connection.
th: กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต

# BROWSER_OVERLAY_DEFAULT_TEXT
source: Loading...
th: กำลังโหลด...

# JR_CLOSE_BUTTON_TITLE
source: Close
th: ปิด

# JR_SEARCH_RESULTS_NON_STRICT_MATCHED_ALERT_MESSAGE
source: Sorry, we couldn't find flights between selected airports for the route %@. However, we can show you other flights between these cities.
th: คุณได้ค้นหาเส้นทางเที่ยวบิน %@ ขออภัย ไม่สามารถค้นหาเที่ยวบินที่บินระหว่างสนามบินเหล่านี้

# JR_SEARCH_RESULTS_TICKET_IN_THE
source: on
th: ใน

# JR_TICKET_CREDIT_ALERT_BUY_BUTTON
source: Buy
th: ซื้อ

# JR_TICKET_CREDIT_ALERT_CONDITIONS
source: Terms and Conditions
th: ข้อกำหนดและเงื่อนไข

# JR_TICKET_CREDIT_ALERT_PAYMENTS##{few}
source: payments
th: การชำระเงิน

# JR_TICKET_CREDIT_ALERT_PAYMENTS##{one}
source: payment
th: การชำระเงิน

# JR_TICKET_CREDIT_ALERT_CANCEL_BUTTON
source: Cancel
th: ยกเลิก

# JR_TICKET_CREDIT_ALERT_DAYS##{one}
source: day
th: วัน

# JR_TICKET_CREDIT_ALERT_PAYMENTS##{other}
source: payments
th: การชำระเงิน

# JR_TICKET_CREDIT_ALERT_PAYMENTS##{many}
source: payments
th: การชำระเงิน

# JR_TICKET_CREDIT_ALERT_DAYS##{few}
source: days
th: วัน

# JR_TICKET_CREDIT_ALERT_MONTH
source: month
th: เดือน

# JR_TICKET_CREDIT_ALERT_DAYS##{other}
source: days
th: วัน

# JR_TICKET_CREDIT_ALERT_TILL
source: until
th: จนถึง

# JR_TICKET_CREDIT_ALERT_DAYS##{many}
source: days
th: วัน

# JR_TICKET_CREDIT_ALERT_OVERPAYMENT
source: Overpayment
th: ชำระเกินจำนวน

# JR_TICKET_CREDIT_ALERT_DURATION
source: Term of loan
th: เงื่อนไขการกู้ยืม

# JR_TICKET_CREDIT_ALERT_OVERPAYMENT_SUFFIX
source: of the price
th: ของราคา

# JR_TICKET_CREDIT_ALERT_GRACE_PERIOD
source: Grace period
th: ระยะเวลาผ่อนผัน

# JR_TICKET_CREDIT_MONTH_2
source: february
th: กุมภาพันธ์

# JR_TICKET_CREDIT_MONTH_1
source: january
th: มกราคม

# JR_TICKET_CREDIT_MONTH_3
source: march
th: มีนาคม

# JR_TICKET_CREDIT_MONTH_6
source: june
th: มิถุนายน

# JR_TICKET_CREDIT_MONTH_4
source: april
th: เมษายน

# JR_TICKET_CREDIT_MONTH_7
source: july
th: กรกฎาคม

# JR_TICKET_CREDIT_MONTH_5
source: may
th: พฤษภาคม

# JR_TICKET_CREDIT_MONTH_8
source: august
th: สิงหาคม

# JR_TICKET_CREDIT_MONTH_9
source: september
th: กันยายน

# JR_TICKET_CREDIT_MONTH_10
source: october
th: ตุลาคม

# JR_TICKET_CREDIT_MONTH_11
source: november
th: พฤศจิกายน

# JR_TICKET_CREDIT_MONTH_12
source: december
th: ธันวาคม

# JR_TICKET_BUY_IN_THE_AGENCY_BUTTON
source: Buy at
th: ซื้อที่

# JR_TICKET_BUY_BUTTON
source: Buy ticket
th: ซื้อตั๋ว

# JR_TICKET_BUY_IN_CREDIT_BUTTON
source: Get a loan
th: ขอสินเชื่อ

# JR_TICKET_FLIGHT
source: Flight
th: เที่ยวบิน

# JR_TICKET_TRANSFER
source: Stopover
th: จุดแวะพัก

# JR_TICKET_OTHER_BUTTON
source: Other
th: อื่นๆ

# JR_TICKET_DURATION
source: Journey time
th: ระยะเวลาการเดินทาง

# JR_WAITING_TITLE
source: Searching...
th: กำลังค้นหา...

# JR_WAITING_ERROR_NOT_FOUND_MESSAGE
source: No results found. Try adjusting search parameters.
th: ไม่พบผลลัพธ์ ลองปรับเปลี่ยนตัวแปรการค้นหา

# JR_WAITING_ERROR_CONNECTION_ERROR
source: Connection error
th: การเชื่อมต่อผิดพลาด

# JR_WAITING_ERROR_NOT_AVALIBLE_MESSAGE
source: Sorry, the Jetradar service is temporarily unavailable
th: ขออภัย JetRadar ไม่สามารถให้บริการได้ชั่วคราว
